#include <stdio.h>
/* Задано дійсне число x. Визначити значення заданої за варі-
антом кусочно-безперервної функції y(x), якщо воно існує, або
вивести на екран повідомлення про неіснування функції для за-
даного x.*/

/* в програмі необхідно обов’язково використати булеві (логі-
чні) операції (not, and, or, тощо); використання булевих операцій
не повинно бути надлишковим. */

/*   [ 10x^3 + 7x/5 + 2, x ∈ [–49,–10) U (0,10]
y = {
     [ –x + 9, x ∈ (20, + ∞) */

int main(int argc, char const *argv[])
{
    char *invalidValue = "Задане значення x не підпадає під ОДЗ задану у частині рівняння\n\0";
    
    return 0;
}
