#include <stdio.h>

/* Задано дійсне число x. Визначити значення заданої за варі-
антом кусочно-безперервної функції y(x), якщо воно існує, або
вивести на екран повідомлення про неіснування функції для за-
даного x.*/

/* в програмі дозволяється лише одиничні операції порівняння
 (=,<>,<,<=,>,>=) і не дозволяються булеві операції) */

/*   [ 10x^3 + 7x/5 + 2, x ∈ [–49,–10) U (0,10]
y = {
     [ –x + 9, x ∈ (20, + ∞) */

int main(int argc, char const *argv[])
{
    double x, y;
    char *invalidValue = "Задане значення x не підпадає під ОДЗ задану у частині рівняння\n\0";

    printf("Введіть x: ");
    scanf("%lf", &x);

    if (-10 > x >= -49, 10 >= x > 0)
    {
        y = 10 * (x*x*x) + (7 * x / 5) + 2;
        printf("1. y(%.2lf) = %.2lf для y = 10x^3 + 7x/5 + 2, x ∈ [-49,-10) U (0,10]\n", x, y);
    }
    else
    {
        printf("1.");
        printf(invalidValue);
    }

    if (x > 20)
    {
        y = -x + 9;
        printf("2. y(%.2lf) = %.2lf для y = -x + 9, x ∈ (20, + ∞)\n", x, y);
    }
    else
    {
        printf("2.");
        printf(invalidValue);
    }
    
    return 0;
}
